Revit 2027 API
DeleteWorksetSettings(DeleteWorksetOption, WorksetId) Constructor
 Constructs a DeleteWorksetSettings object.
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public DeleteWorksetSettings(
	DeleteWorksetOption deleteWorksetOption,
	WorksetId elementsMoveInto
)
Public Sub New (
	deleteWorksetOption As DeleteWorksetOption,
	elementsMoveInto As WorksetId
)
public:
DeleteWorksetSettings(
	DeleteWorksetOption deleteWorksetOption,
	WorksetId^ elementsMoveInto
)
new :
        deleteWorksetOption : DeleteWorksetOption *
        elementsMoveInto : WorksetId -> DeleteWorksetSettings
Parameters
deleteWorksetOption DeleteWorksetOption
elementsMoveInto WorksetId
Exceptions
Exception | Condition
ArgumentNullException |  A non-optional argument was null
ArgumentOutOfRangeException |  A value passed for an enumeration argument is not a member of that enumeration
Remarks
 elementsMoveInto only takes effect when DeleteWorksetOption::Enum is MoveElementsToWorkset.
See Also
Reference
DeleteWorksetSettings Class
DeleteWorksetSettings Overload
Autodesk.Revit.DB Namespace